#### Import Libraries & Dataset

In [1]:
import numpy
import pandas

# import the titanic dataset
titanic = pandas.read_csv('Titanic.csv')

#### Ex.2.1 Return the items without age information provided in the last 10 rows of Titanic by using Boolean Mask and `isnull()`

In [3]:
# code for Ex.2.1
titanic_tail10 = titanic.tail(10).copy()
# titanic_tail10[titanic.isnull()['Age'] == True]
titanic_tail10[titanic_tail10['Age'].isnull() == True]

                     Name PClass  Age     Sex  Survived
1304   Youssef, Mr Gerios    3rd  NaN    male         0
1305  Zabour, Miss Hileni    3rd  NaN  female         0
1306  Zabour, Miss Tamini    3rd  NaN  female         0

#### Ex.2.2 Count items without NaN data in Titanic dataset

In [4]:
# code for Ex.2.2
titanic.dropna().shape[0]

756

#### Ex.2.3 Fill all the items containing `NaN` age in the last 10 rows of Titanic with 22 by using `.fillna()`

In [5]:
print (titanic_tail10)


# code for Ex.2.3
titanic_tail10.fillna(22)

                        Name PClass   Age     Sex  Survived
1302      Yasbeck, Mr Antoni    3rd  27.0    male         0
1303     Yasbeck, Mrs Antoni    3rd  15.0  female         1
1304      Youssef, Mr Gerios    3rd   NaN    male         0
1305     Zabour, Miss Hileni    3rd   NaN  female         0
1306     Zabour, Miss Tamini    3rd   NaN  female         0
1307      Zakarian, Mr Artun    3rd  27.0    male         0
1308  Zakarian, Mr Maprieder    3rd  26.0    male         0
1309        Zenni, Mr Philip    3rd  22.0    male         0
1310        Lievens, Mr Rene    3rd  24.0    male         0
1311          Zimmerman, Leo    3rd  29.0    male         0

                        Name PClass   Age     Sex  Survived
1302      Yasbeck, Mr Antoni    3rd  27.0    male         0
1303     Yasbeck, Mrs Antoni    3rd  15.0  female         1
1304      Youssef, Mr Gerios    3rd  22.0    male         0
1305     Zabour, Miss Hileni    3rd  22.0  female         0
1306     Zabour, Miss Tamini    3rd  22.0  female         0
1307      Zakarian, Mr Artun    3rd  27.0    male         0
1308  Zakarian, Mr Maprieder    3rd  26.0    male         0
1309        Zenni, Mr Philip    3rd  22.0    male         0
1310        Lievens, Mr Rene    3rd  24.0    male         0
1311          Zimmerman, Leo    3rd  29.0    male         0

#### Ex.2.4 Fill all the `NaN` age with the age values from previous item

In [6]:
# code for Ex.2.4
titanic_tail10.fillna(method='ffill')

                        Name PClass   Age     Sex  Survived
1302      Yasbeck, Mr Antoni    3rd  27.0    male         0
1303     Yasbeck, Mrs Antoni    3rd  15.0  female         1
1304      Youssef, Mr Gerios    3rd  15.0    male         0
1305     Zabour, Miss Hileni    3rd  15.0  female         0
1306     Zabour, Miss Tamini    3rd  15.0  female         0
1307      Zakarian, Mr Artun    3rd  27.0    male         0
1308  Zakarian, Mr Maprieder    3rd  26.0    male         0
1309        Zenni, Mr Philip    3rd  22.0    male         0
1310        Lievens, Mr Rene    3rd  24.0    male         0
1311          Zimmerman, Leo    3rd  29.0    male         0

#### Ex.2.5 Add the values in the third column to each column in the following provided Table:
| | one | two | three |
|-|:---:|:---:|:-----:|
|a|  1  |  2  |   2   |
|b|  3  |  1  |   9   |
|c|  4  |  4  |   1   |
|d|  7  |  9  |   3   |

In [9]:
# code for Ex.2.5
df = pandas.DataFrame({'one'   : pandas.Series([1, 3, 4, 7], index=['a', 'b', 'c', 'd']),
                       'two'   : pandas.Series([2, 1, 4, 9], index=['a', 'b', 'c', 'd']),
                       'three' : pandas.Series([2, 9, 1, 3], index=['a', 'b', 'c', 'd'])})
df

third_col = df['three']
df.add(third_col, axis='index')

   one  two  three
a    3    4      4
b   12   10     18
c    5    5      2
d   10   12      6